{
    "pages": [
        {
            "tags": "",
            "text": "",
            "title": "Orange Dragon beta",
            "url": "/index.html"
        },
        {
            "tags": "",
            "text": "This page describes a way to deploy the website. The website is built in the _build subdirectory.  To deploy it, you must\ntransfer the contents of that subdirectory to the production web server.  There\nare many ways to do this.  An exhaustive overview is beyond the scope of this\nsite, but we will describe one technique which is particularly elegant. This is\nthe method used for Urubu Quickstart itself. Urubu Quickstart is developed using git and hosted on GitHub .  GitHub\noffers GitHub Pages as a way to host websites from the project repository\nitself.  Technically, this is accomplished by maintaining the website content\non a specific branch, called gh-pages . If you use git and GitHub, you can deploy your website to GitHub\npages with the following command: git subtree push --prefix _build origin gh-pages When the gh-pages branch does not exist yet it will be created.\nIt is a good idea to put the command in the Makefile to make it\neasy to use. The website will be published at http://<username>.github.io/<repository> .\nYou can also use a custom url.",
            "title": "Deploy",
            "url": "/deploy.html"
        },
        {
            "tags": "",
            "text": "Personenbezogene Daten (nachfolgend zumeist nur „Daten“ genannt) werden von uns nur im Rahmen der Erforderlichkeit sowie zum Zwecke der Bereitstellung eines funktionsfähigen und nutzerfreundlichen Internetauftritts, inklusive seiner Inhalte und der dort angebotenen Leistungen, verarbeitet. Gemäß Art. 4 Ziffer 1. der Verordnung (EU) 2016/679, also der Datenschutz-Grundverordnung (nachfolgend nur „DSGVO“ genannt), gilt als „Verarbeitung“ jeder mit oder ohne Hilfe automatisierter Verfahren ausgeführter Vorgang oder jede solche Vorgangsreihe im Zusammenhang mit personenbezogenen Daten, wie das Erheben, das Erfassen, die Organisation, das Ordnen, die Speicherung, die Anpassung oder Veränderung, das Auslesen, das Abfragen, die Verwendung, die Offenlegung durch Übermittlung, Verbreitung oder eine andere Form der Bereitstellung, den Abgleich oder die Verknüpfung, die Einschränkung, das Löschen oder die Vernichtung. Mit der nachfolgenden Datenschutzerklärung informieren wir Sie insbesondere über Art, Umfang, Zweck, Dauer und Rechtsgrundlage der Verarbeitung personenbezogener Daten, soweit wir entweder allein oder gemeinsam mit anderen über die Zwecke und Mittel der Verarbeitung entscheiden. Zudem informieren wir Sie nachfolgend über die von uns zu Optimierungszwecken sowie zur Steigerung der Nutzungsqualität eingesetzten Fremdkomponenten, soweit hierdurch Dritte Daten in wiederum eigener Verantwortung verarbeiten. Unsere Datenschutzerklärung ist wie folgt gegliedert: I. Informationen über uns als Verantwortliche II. Rechte der Nutzer und Betroffenen III. Informationen zur Datenverarbeitung I. Informationen über uns als Verantwortliche Die Kontaktdaten des verantwortlichen Anbieters dieses Internetauftritts im datenschutzrechtlichen Sinne finden Sie in unserem Impressum. II. Rechte der Nutzer und Betroffenen Mit Blick auf die nachfolgend noch näher beschriebene Datenverarbeitung haben die Nutzer und Betroffenen das Recht auf Bestätigung, ob sie betreffende Daten verarbeitet werden, auf Auskunft über die verarbeiteten Daten, auf weitere Informationen über die Datenverarbeitung sowie auf Kopien der Daten (vgl. auch Art. 15 DSGVO);\nauf Berichtigung oder Vervollständigung unrichtiger bzw. unvollständiger Daten (vgl. auch Art. 16 DSGVO);\nauf unverzügliche Löschung der sie betreffenden Daten (vgl. auch Art. 17 DSGVO), oder, alternativ, soweit eine weitere Verarbeitung gemäß Art. 17 Abs. 3 DSGVO erforderlich ist, auf Einschränkung der Verarbeitung nach Maßgabe von Art. 18 DSGVO;\nauf Erhalt der sie betreffenden und von ihnen bereitgestellten Daten und auf Übermittlung dieser Daten an andere Anbieter/Verantwortliche (vgl. auch Art. 20 DSGVO);\nauf Beschwerde gegenüber der Aufsichtsbehörde, sofern sie der Ansicht sind, dass die sie betreffenden Daten durch den Anbieter unter Verstoß gegen datenschutzrechtliche Bestimmungen verarbeitet werden (vgl. auch Art. 77 DSGVO).\nDarüber hinaus ist der Anbieter dazu verpflichtet, alle Empfänger, denen gegenüber Daten durch den Anbieter offengelegt worden sind, über jedwede Berichtigung oder Löschung von Daten oder die Einschränkung der Verarbeitung, die aufgrund der Artikel 16, 17 Abs. 1, 18 DSGVO erfolgt, zu unterrichten. Diese Verpflichtung besteht jedoch nicht, soweit diese Mitteilung unmöglich oder mit einem unverhältnismäßigen Aufwand verbunden ist. Unbeschadet dessen hat der Nutzer ein Recht auf Auskunft über diese Empfänger. Ebenfalls haben die Nutzer und Betroffenen nach Art. 21 DSGVO das Recht auf Widerspruch gegen die künftige Verarbeitung der sie betreffenden Daten, sofern die Daten durch den Anbieter nach Maßgabe von Art. 6 Abs. 1 lit. f) DSGVO verarbeitet werden. Insbesondere ist ein Widerspruch gegen die Datenverarbeitung zum Zwecke der Direktwerbung statthaft. III. Informationen zur Datenverarbeitung Ihre bei Nutzung unseres Internetauftritts verarbeiteten Daten werden gelöscht oder gesperrt, sobald der Zweck der Speicherung entfällt, der Löschung der Daten keine gesetzlichen Aufbewahrungspflichten entgegenstehen und nachfolgend keine anderslautenden Angaben zu einzelnen Verarbeitungsverfahren gemacht werden. Cookies a) Sitzungs-Cookies/Session-Cookies Wir verwenden mit unserem Internetauftritt sog. Cookies. Cookies sind kleine Textdateien oder andere Speichertechnologien, die durch den von Ihnen eingesetzten Internet-Browser auf Ihrem Endgerät ablegt und gespeichert werden. Durch diese Cookies werden im individuellen Umfang bestimmte Informationen von Ihnen, wie beispielsweise Ihre Browser- oder Standortdaten oder Ihre IP-Adresse, verarbeitet. Durch diese Verarbeitung wird unser Internetauftritt benutzerfreundlicher, effektiver und sicherer, da die Verarbeitung bspw. die Wiedergabe unseres Internetauftritts in unterschiedlichen Sprachen oder das Angebot einer Warenkorbfunktion ermöglicht. Rechtsgrundlage dieser Verarbeitung ist Art. 6 Abs. 1 lit b.) DSGVO, sofern diese Cookies Daten zur Vertragsanbahnung oder Vertragsabwicklung verarbeitet werden. Falls die Verarbeitung nicht der Vertragsanbahnung oder Vertragsabwicklung dient, liegt unser berechtigtes Interesse in der Verbesserung der Funktionalität unseres Internetauftritts. Rechtsgrundlage ist in dann Art. 6 Abs. 1 lit. f) DSGVO. Mit Schließen Ihres Internet-Browsers werden diese Session-Cookies gelöscht. b) Drittanbieter-Cookies Gegebenenfalls werden mit unserem Internetauftritt auch Cookies von Partnerunternehmen, mit denen wir zum Zwecke der Werbung, der Analyse oder der Funktionalitäten unseres Internetauftritts zusammenarbeiten, verwendet. Die Einzelheiten hierzu, insbesondere zu den Zwecken und den Rechtsgrundlagen der Verarbeitung solcher Drittanbieter-Cookies, entnehmen Sie bitte den nachfolgenden Informationen. c) Beseitigungsmöglichkeit Sie können die Installation der Cookies durch eine Einstellung Ihres Internet-Browsers verhindern oder einschränken. Ebenfalls können Sie bereits gespeicherte Cookies jederzeit löschen. Die hierfür erforderlichen Schritte und Maßnahmen hängen jedoch von Ihrem konkret genutzten Internet-Browser ab. Bei Fragen benutzen Sie daher bitte die Hilfefunktion oder Dokumentation Ihres Internet-Browsers oder wenden sich an dessen Hersteller bzw. Support. Bei sog. Flash-Cookies kann die Verarbeitung allerdings nicht über die Einstellungen des Browsers unterbunden werden. Stattdessen müssen Sie insoweit die Einstellung Ihres Flash-Players ändern. Auch die hierfür erforderlichen Schritte und Maßnahmen hängen von Ihrem konkret genutzten Flash-Player ab. Bei Fragen benutzen Sie daher bitte ebenso die Hilfefunktion oder Dokumentation Ihres Flash-Players oder wenden sich an den Hersteller bzw. Benutzer-Support. Sollten Sie die Installation der Cookies verhindern oder einschränken, kann dies allerdings dazu führen, dass nicht sämtliche Funktionen unseres Internetauftritts vollumfänglich nutzbar sind. YouTube Wir unterhalten bei YouTube eine Onlinepräsenz um unser Unternehmen sowie unsere Leistungen zu präsentieren und mit Kunden/Interessenten zu kommunizieren. YouTube ist ein Service der Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Irland, ein Tochterunternehmen der Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA. Insofern weisen wir darauf hin, dass die Möglichkeit besteht, dass Daten der Nutzer außerhalb der Europäischen Union, insbesondere in den USA, verarbeitet werden. Hierdurch können gesteigerte Risiken für die Nutzer insofern bestehen, als dass z.B. der spätere Zugriff auf die Nutzerdaten erschwert werden kann. Auch haben wir keinen Zugriff auf diese Nutzerdaten. Die Zugriffsmöglichkeit liegt ausschließlich bei YouTube. Die Datenschutzhinweise von YouTube finden Sie unter https://policies.google.com/privacy Verlinkung Social-Media über Grafik oder Textlink Wir bewerben auf unserer Webseite auch Präsenzen auf den nachstehend aufgeführten sozialen Netzwerken. Die Einbindung erfolgt dabei über eine verlinkte Grafik des jeweiligen Netzwerks. Durch den Einsatz dieser verlinkten Grafik wird verhindert, dass es bei dem Aufruf einer Website, die über eine Social-Media-Bewerbung verfügt, automatisch zu einem Verbindungsaufbau zum jeweiligen Server des sozialen Netzwerks kommt, um eine Grafik des jeweiligen Netzwerkes selbst darzustellen. Erst durch einen Klick auf die entsprechende Grafik wird der Nutzer zu dem Dienst des jeweiligen sozialen Netzwerks weitergeleitet. Nach der Weiterleitung des Nutzers werden durch das jeweilige Netzwerk Informationen über den Nutzer erfasst. Es kann hierbei nicht ausgeschlossen werden, dass eine Verarbeitung der so erhobenen  Daten in den USA stattfindet. Dies sind zunächst Daten wie IP-Adresse, Datum, Uhrzeit und besuchte Seite. Ist der Nutzer währenddessen in seinem Benutzerkonto des jeweiligen Netzwerks eingeloggt, kann der Netzwerk-Betreiber ggf. die gesammelten Informationen des konkreten Besuchs des Nutzers dem persönlichen Account des Nutzers zuordnen. Interagiert der Nutzer über einen „Teilen“-Button des jeweiligen Netzwerks, können diese Informationen in dem persönlichen Benutzerkonto des Nutzers gespeichert und ggf. veröffentlicht werden. Will der Nutzer verhindern, dass die gesammelten Informationen unmittelbar seinem Benutzerkonto zugeordnet werden, muss er sich vor dem Anklicken der Grafik ausloggen. Zudem besteht die Möglichkeit, das jeweilige Benutzerkonto entsprechend zu konfigurieren. Folgende soziale Netzwerke werden in unsere Seite durch Verlinkung eingebunden: YouTube Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Irland, ein Tochterunternehmen der Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA Datenschutzerklärung: https://policies.google.com/privacy Google Analytics In unserem Internetauftritt setzen wir Google Analytics ein. Hierbei handelt es sich um einen Webanalysedienst der Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Irland, nachfolgend nur „Google“ genannt. Der Dienst Google Analytics dient zur Analyse des Nutzungsverhaltens unseres Internetauftritts. Rechtsgrundlage ist Art. 6 Abs. 1 lit. f) DSGVO. Unser berechtigtes Interesse liegt in der Analyse, Optimierung und dem wirtschaftlichen Betrieb unseres Internetauftritts. Nutzungs- und nutzerbezogene Informationen, wie bspw. IP-Adresse, Ort, Zeit oder Häufigkeit des Besuchs unseres Internetauftritts, werden dabei an einen Server von Google in den USA übertragen und dort gespeichert. Allerdings nutzen wir Google Analytics mit der sog. Anonymisierungsfunktion. Durch diese Funktion kürzt Google die IP-Adresse schon innerhalb der EU bzw. des EWR. Die so erhobenen Daten werden wiederum von Google genutzt, um uns eine Auswertung über den Besuch unseres Internetauftritts sowie über die dortigen Nutzungsaktivitäten zur Verfügung zu stellen. Auch können diese Daten genutzt werden, um weitere Dienstleistungen zu erbringen, die mit der Nutzung unseres Internetauftritts und der Nutzung des Internets zusammenhängen. Google gibt an, Ihre IP-Adresse nicht mit anderen Daten zu verbinden. Zudem hält Google unter https://www.google.com/intl/de/policies/privacy/partners weitere datenschutzrechtliche Informationen für Sie bereit, so bspw. auch zu den Möglichkeiten, die Datennutzung zu unterbinden. Zudem bietet Google unter https://tools.google.com/dlpage/gaoptout?hl=de ein sog. Deaktivierungs-Add-on nebst weiteren Informationen hierzu an. Dieses Add-on lässt sich mit den gängigen Internet-Browsern installieren und bietet Ihnen weitergehende Kontrollmöglichkeit über die Daten, die Google bei Aufruf unseres Internetauftritts erfasst. Dabei teilt das Add-on dem JavaScript (ga.js) von Google Analytics mit, dass Informationen zum Besuch unseres Internetauftritts nicht an Google Analytics übermittelt werden sollen. Dies verhindert aber nicht, dass Informationen an uns oder an andere Webanalysedienste übermittelt werden. Ob und welche weiteren Webanalysedienste von uns eingesetzt werden, erfahren Sie natürlich ebenfalls in dieser Datenschutzerklärung. YouTube In unserem Internetauftritt setzen wir YouTube ein. Hierbei handelt es sich um ein Videoportal der YouTube LLC., 901 Cherry Ave., 94066 San Bruno, CA, USA, nachfolgend nur „YouTube“ genannt. YouTube ist ein Tochterunternehmen der Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Irland, nachfolgend nur „Google“ genannt. Wir nutzen YouTube im Zusammenhang mit der Funktion „Erweiterter Datenschutzmodus“, um Ihnen Videos anzeigen zu können. Rechtsgrundlage ist Art. 6 Abs. 1 lit. f) DSGVO. Unser berechtigtes Interesse liegt in der Qualitätsverbesserung unseres Internetauftritts. Die Funktion „Erweiterter Datenschutzmodus“ bewirkt laut Angaben von YouTube, dass die nachfolgend noch näher bezeichneten Daten nur dann an den Server von YouTube übermittelt werden, wenn Sie ein Video auch tatsächlich starten. Ohne diesen „Erweiterten Datenschutz“ wird eine Verbindung zum Server von YouTube in den USA hergestellt, sobald Sie eine unserer Internetseiten, auf der ein YouTube-Video eingebettet ist, aufrufen. Diese Verbindung ist erforderlich, um das jeweilige Video auf unserer Internetseite über Ihren Internet-Browser darstellen zu können. Im Zuge dessen wird YouTube zumindest Ihre IP-Adresse, das Datum nebst Uhrzeit sowie die von Ihnen besuchte Internetseite erfassen und verarbeiten. Zudem wird eine Verbindung zu dem Werbenetzwerk „DoubleClick“ von Google hergestellt. Sollten Sie gleichzeitig bei YouTube eingeloggt sein, weist YouTube die Verbindungsinformationen Ihrem YouTube-Konto zu. Wenn Sie das verhindern möchten, müssen Sie sich entweder vor dem Besuch unseres Internetauftritts bei YouTube ausloggen oder die entsprechenden Einstellungen in Ihrem YouTube-Benutzerkonto vornehmen. Zum Zwecke der Funktionalität sowie zur Analyse des Nutzungsverhaltens speichert YouTube dauerhaft Cookies über Ihren Internet-Browser auf Ihrem Endgerät. Falls Sie mit dieser Verarbeitung nicht einverstanden sind, haben Sie die Möglichkeit, die Speicherung der Cookies durch eine Einstellung in Ihrem Internet-Browsers zu verhindern. Nähere Informationen hierzu finden Sie vorstehend unter „Cookies“. Weitergehende Informationen über die Erhebung und Nutzung von Daten sowie Ihre diesbezüglichen Rechte und Schutzmöglichkeiten hält Google in den unter https://policies.google.com/privacy abrufbaren Datenschutzhinweisen bereit. jsdelivr.net-CDN Zur Optimierung der Abrufgeschwindigkeit, der Gestaltung und Darstellung der Inhalte unseres Internetauftritts auf unterschiedlichen Endgeräten setzen wir in unserem Internetauftritt den Dienst jsdeliver.com, ein Content Delivery Network („CDN“), ein. Hierbei handelt es sich um einen Open-Source-Dienst, der von der Prospectone Sp.z.o.o., ul. Krolweska 65A, 30-081, Krakow, Polen. Um die Inhalte unseres Internetauftritts schnell ausliefern zu können, greift der Dienst auf sog. JavaScript-Bibliotheken zurück. Dabei werden entsprechende Dateien von einem Drittserver geladen, der Ihre IP-Adresse erfasst. Wir haben dabei keinen Einfluss darauf, ob Ihre IP-Adresse durch Dritte zu statistischen Zwecken verarbeitet wird. Die Prospectone Sp.z.o.o. bietet unter https://www.jsdelivr.com/privacy-policy-jsdelivr-net weitergehende Datenschutzinformationen an. Rechtsgrundlage ist Art. 6 Abs. 1 lit. f) DSGVO. Unser berechtigtes Interesse liegt in der Beschleunigung der Ladezeiten unseres Internetauftritts sowie in dessen Optimierung. Um die Ausführung des Java-Script-Codes von jsdeliver.net insgesamt zu verhindern, können Sie einen sog. Java-Script-Blocker installieren, wie bspw. noscript.net oder ghostery.com. Sollten Sie die Ausführung des Java-Script-Codes verhindern oder einschränken, kann dies aus technischen Gründen allerdings dazu führen, dass womöglich nicht sämtliche Inhalte und Funktionen unseres Internetauftritts verfügbar sind. Amazon-Partnerprogramm In unserem Internetauftritt setzen wir das AMAZON-Partnerprogramm ein. Es handelt sich hierbei um einen Dienst der Amazon Europe Core S.à r.l., 5 Rue Plaetis, L -2338 Luxemburg.  Über das AMAZON-Partnerprogramm werden in unserem Internetauftritt Werbeanzeigen von Amazon.de platziert. Klicken Sie auf eine dieser Werbeanzeigen, werden Sie zu dem damit korrespondierenden Angebot auf dem AMZON-Internetportal weitergeleitet. Sofern Sie sich dort anschließend für den Kauf des beworbenen Produkts entscheiden, erhalten wir hierfür eine „Vermittlungsprovision“ von Amazon. Damit dieser Dienst ermöglicht werden kann, setzt Amazon Cookies ein. Mit Hilfe dieser Cookies kann Amazon nachvollziehen, dass Sie von unserem Internetauftritt auf das AMAZON- Internetportal weitergeleitet worden sind. Amazon bietet unter https://www.amazon.de/gp/help/customer/display.html?nodeId=201909010 weitergehende Datenschutzinformationen an. Rechtsgrundlage ist Art. 6 Abs. 1 lit. f) DSGVO. Unser berechtigtes Interesse liegt in der Gewährleistung der Abwicklung und Auszahlung unserer Provisionsansprüche durch Amazon. Falls Sie mit dieser Verarbeitung nicht einverstanden sind, haben Sie die Möglichkeit, die Speicherung der Cookies durch eine Einstellung in Ihrem Internet-Browsers zu verhindern. Nähere Informationen hierzu finden Sie vorstehend unter „Cookies“. Muster-Datenschutzerklärung der Anwaltskanzlei Weiß & Partner",
            "title": "Datenschutzerklärung",
            "url": "/privacy.html"
        },
        {
            "tags": "",
            "text": "Logo Logo vector created by vectortwins - www.freepik.com Website Generierung Urubu Urubu Quickstart site Gestaltungselemente Bootstrap Datenschutzerklärung Muster-Datenschutzerklärung der Anwaltskanzlei Weiß & Partner .",
            "title": "Credits",
            "url": "/credits.html"
        },
        {
            "tags": "",
            "text": "",
            "title": "Search",
            "url": "/search.html"
        },
        {
            "tags": "",
            "text": "Gesetzliche Anbieterkennung Christian Gruber Mutter-Teresa-Str. 20 81829 München Deutschland Kontakt E-Mail: christian.gruber@web.de Streitschlichtung Die Europäische Kommission stellt eine Plattform zur Online-Streitbeilegung (OS) bereit: https://ec.europa.eu/consumers/odr . Unsere E-Mail-Adresse finden Sie oben im Impressum. Wir sind nicht bereit oder verpflichtet, an Streitbeilegungsverfahren vor einer Verbraucherschlichtungsstelle teilzunehmen.",
            "title": "Impressum",
            "url": "/impressum.html"
        },
        {
            "tags": "",
            "text": "This page describes the concepts that you need to\nadd content to your Urubu project. Website structure The website structure matches the project directory structure exactly. This\nfeature makes it easy to organize content and to refer to other pages. Each file with extension .md is a content file that corresponds to a website\npage. Upon a website build, each content file is compiled into a .html page.\nAll other files and directories are copied to the website, except those whose\nnames start with an underscore _ . Content files A content file starts with a section between triple dashes --- .  This is the\nYAML frontmatter with page variables such as title and layout . After the frontmatter follows the actual content. The format is Markdown with\nextensions . Layouts Each content file uses the layout variable to specify the look of the \npage. Urubu Quickstart defines a number of layouts. The page layout yields a page\nwith a sidebar for the table of contents. If you don't need a sidebar, use the simple_page layout. Reference ids Urubu resolves reference ids in Markdown content, specified by\nthe syntax [<reference-id>] . Reference ids are names that refer to links. In Urubu, the pathname of a page\nor folder (without extension) can be used as its reference id. In addition, the reflinks variable in file _site.yml defines reference ids for external\nurls. Folders A project subdirectory maps to a folder on the website.  The folder content is\ndefined in the index.md file.  The first option is to list the folder content\nexplicitly in content variable, as a list of reference ids.  As an example,\nsee Manual demo .  The second option is to specify the content ordering. For\nexample, for a blog you would set the order variable to date , and the reverse variable to true .  As an example, see Blog demo . For index.md files, you can use the index layout, which lists the contents\nof the folder. Navbar The navbar at the top is defined by the content variable of the top-level index.md file.",
            "title": "Add content",
            "url": "/content.html"
        },
        {
            "tags": "",
            "text": "Urubu Quickstart is a companion site of Urubu , Holzeule a tool to develop static\nwebsites.  You can use it set up a new Urubu project quickly. Usage Urubu Quickstart is both a starting point and a tutorial. Just follow\nthe steps in the next sections and pages. Install Urubu Urubu works with modern versions of Python 2 and Python 3 using the same\ncodebase. More specifically, it requires Python 2.7 or Python 3.4.\nYou can install it using pip: pip install urubu If pip is not yet available on your system, follow the pip installation\ninstructions . Install Urubu Quickstart locally Download the zip archive with the Urubu Quickstart\nsource and unzip it. The resulting directory is your new project directory.\nRename it appropriately.  Go into the project directory and run make to\nbuild the website locally. In a separate terminal window , go into the project directory and run make\nserve .  This starts a local web server for the locally built website.  You can\nview it in a browser on localhost:8000 .  Note that it\nis identical to Urubu Quickstart site . You are now ready to make changes. Keep the local webserver running while\nmaking changes, so that you can verify them in the browser. Set the brand name The file _site.yml contains project configuration variables.  As a first\nchange, edit _site.yml and set the brand variable to the name of your\nproject. Run make and the verify the change in the browser, at the left side\nin the top navbar. Adapt the home page The index.md file corresponds to the home page of the site. It has a title and the tagline variable that are displayed prominently. Adapt them to your\nproject, run make and verify the changes.",
            "title": "Start",
            "url": "/start.html"
        },
        {
            "tags": "",
            "text": "Urubu and the technologies behind it offer a wide range of\nadditional features. On this page we list some possibilities. Layouts All layouts are defined in the _layout subdirectory.  They are implemented as\n[Jinja2 Templates][jinja2].  You can modify existing layouts or create new\nones. You can use template inheritance to implement just the desired feature\nin a layout, and reuse everything else from the parent layout. Templating constructs in pages The use of templating constructs is not limited to layouts: you can use them in\nregular pages also. This is a powerful way to define custom syntax extensions.\nFor more info, see Templating constructs in pages . Bootstrap Urubu was designed to work well with Bootstrap , a framework of ready-to-use\nwebsite components, style sheets and javascript functions. You can use\nBootstrap features to customize your layouts. Alternatively, you can switch to\nanother framework altogether. Search Urubu supports Tipue Search , an open source search solution\nbased on Javascript in the browser. Urubu Quickstart has this feature set up.\nTo learn more, read the chapter Search in the manual. Tags Urubu supports tags. This is described in this faq and in the manual . Formulas If you would like to create beautiful formulas in your\nUrubu website, check this post .",
            "title": "Advanced features",
            "url": "/advanced.html"
        },
        {
            "tags": "",
            "text": "This page describes some ways to customize the website. Theme The default theme of Urubu Quickstart is based on the stock Bootstrap theme. You can easily get a different look and feel thanks to [bootswatch]. This\nproject develops a number of themes as drop-in replacements for Bootstrap.\nSimply set the bootswatch variable in _site.yml to the name of the desired\nBootswatch theme, such as flatly , yeti or lumen . Navbar The number of items at the right side of the navbar is defined by the navbar_right_items variable. A link to a folder in the navbar can optionally be implemented as a dropdown\nmenu. Set the dropdown variable to true in the index.md file of the\nfolder to enable this feature. As an example, see the demo folder and the Demo menu item. You can also change the look of the navbar by setting navbar_inverse to true . Footer You can customize the content of the page footer in the _layout/footer.html file. Pager You can add a simple pager to the page and simple_page layouts by setting\nthe pager variable to true . More info For more info on customization possibilties, check the Advanced features page.",
            "title": "Customize",
            "url": "/customize.html"
        },
        {
            "tags": "",
            "text": "Navbar The navbar at the top is defined by the content variable of the top-level index.md file.  Its value is a list of reference ids of pages, folders and\nexternal links. The number of items at the right side of the navbar is defined by the navbar_right_items variable. Pages Each Markdown file with extension .md corresponds to a page on\nthe website. In the YAML frontmatter, you define the title and the\nlayout of a page. The default page layout has a sidebar. \nIf you don't need a sidebar, use the simple_page layout. You can add a pager setting the pager variable to true . Folders A folder is a collection of pages. It is implemented as a subdirectory with\ncontent files. The content of a folder is defined in its index.md file.  One option is to\nlist the content explicitly. As an example, see Manual demo .  Another option is to\nspecify the content ordering. For example, for a blog you would set the order variable to date , and the reverse variable to true , as in Blog demo . A link to a folder refers to its index.html page. In the navbar, you can\nimplement it as a dropdown menu instead, by setting the dropdown variable to true in the index.md file. See the demo folder and the Demo menu item. External links You can define reference ids for external links in the reflinks variable in _site.yml .",
            "title": "Organize",
            "url": "/organize.html"
        },
        {
            "tags": "",
            "text": "Introduction First Chapter Second Chapter",
            "title": "Manual demo",
            "url": "/manual/index.html"
        },
        {
            "tags": "",
            "text": "First paragraph. Second paragraph.",
            "title": "Introduction",
            "url": "/manual/intro.html"
        },
        {
            "tags": "",
            "text": "First section Second Section",
            "title": "Second Chapter",
            "url": "/manual/chapter_2.html"
        },
        {
            "tags": "",
            "text": "First section Second Section",
            "title": "First Chapter",
            "url": "/manual/chapter_1.html"
        },
        {
            "tags": "",
            "text": "LEGO Raumstation Die Serie aus den 1980er Jahren hatte ich fast vollständig. Angefangen zu sammeln habe ich mit dem ersten Schultag und habe bis etwa zur fünften Klasse damit gespielt. Derzeit sind die meisten Bausätze wieder für die Kinder aufgebaut. Main call to action Secondary action 886 - Das wohl kleinste Modell der Serie und das mit der niedrigsten Nummer die ich habe. Anleitung original Bild × × 891 - Kleiner Gleiter mit einzigartigen Düsen. 897 - Transportable Rakete mit Radarstation 894 - Mobile Radarstation mit Türen zum öffnen. 920 - Stationäre Rakete mit Treibstoffwagen. 924 - Der Flieger mit dem Gabelstapler und der Schatzkiste Der Schatz waren die Verbindugen der transparenten Teile. 928 - Der große Transporter mit Bodensation und Ladeklappe. 6801 - Hoverjet. 6804 - Kleines Fahrzeug. original Bild × 6821 - Kleiner Bagger. 6822 - Ein kleines Flugzeug mit Greifer. 6823 - Metallsucher. 6841 - Metallsucher Fahrzeug . 6842 - Jet mit ersten weißen Teilen . 6870 - Kleiner Jet auf Fahrzeug mit Rampe . 6880 - Einfach ein cooles Fahrzeug 6890 - Zweiteiliges Flugzeug. 6891 - Der süßeste Roboter der Raumstation. 28 DM 6927 - Transporter mit riesiger Radarstatioin . 6928 - Ein Minenfahrzeug. 6929 - Der Weltraumtransporter mit der größten Kiste die transportiert werden konnte. Mit Original Preisschild und die einzige vorhandene Schachtel. 32,95 DM 6930 - Station mit zwei Flugzeugen und zwei Fahrzeugen. 6951 - Der coole Roboter als Träger für Rakete, Flugzeug und einem Fahrzeug. 6970 - Die Station mit Ruheplatzen einem Schienenfahrzeug und der Flagge. 6971 - Große Station mit Fahrbarer Raketenrampe und Minijet Startrampe. 6980 - Das größte Raumschiff und mein letztes.",
            "title": "LEGO",
            "url": "/lego/index.html"
        },
        {
            "tags": "",
            "text": "Main call to action Secondary action LEGO_886.jpg - 886 Das wohl kleinste Modell der Serie und das mit der niedrigsten Nummer die ich habe. (' \\n \\n \\n \\n LEGO_886.jpg - 886 Das wohl kleinste Modell der Serie und das mit der niedrigsten Nummer die ich habe. \\n \\n \\n \\n \\n \\n \\n\\n \\n \\n', '100')",
            "title": "LEGO Raumstation",
            "url": "/lego/lego.html"
        },
        {
            "tags": "",
            "text": "MY-SQL Creating tables with many varchar fields kann lead to the following error: ERROR Reason: liquibase.exception.DatabaseException: (conn=9) Row size too large (> 8126). Changing some columns to TEXT or BLOB may help. In current row format, BLOB prefix of 0 bytes is stored inline. https://mariadb.com/kb/en/troubleshooting-row-size-too-large-errors-with-innodb/ SET SESSION innodb_strict_mode=OFF; SNIPPETS Calculate duration from two timestamps. https://stackoverflow.com/questions/4759248/difference-between-two-dates-in-mysql/20419537 select count(*), TIMESTAMPDIFF(SECOND, started, finished) as 'duration in seconds' from TABLE_NAME",
            "title": "Programming",
            "url": "/programming/index.html"
        },
        {
            "tags": "",
            "text": "Latest post 15-May-2014 Oldest post 03-Mar-2014",
            "title": "Blog demo",
            "url": "/blog/index.html"
        },
        {
            "tags": "",
            "text": "",
            "title": "Oldest post",
            "url": "/blog/oldest_post.html"
        },
        {
            "tags": "",
            "text": "",
            "title": "Latest post",
            "url": "/blog/latest_post.html"
        },
        {
            "tags": "",
            "text": "Mein Cappuccino Traum Ich trinke gerne Cappuccino und dafür mahle ich die Bohnen gerne per Hand. Main call to action Secondary action Mein erstes Video und ich glaube nicht dass es jemand bis zum Ende ansieht, außer er ist wirklich sehr daran interessiert wie ich Cappuccino mache. 3:52",
            "title": "KAFFEE",
            "url": "/coffee/index.html"
        },
        {
            "tags": "",
            "text": "Mein Cappuccino Traum Ich trinke gerne Cappuccino und dafür mahle ich die Bohnen gerne per Hand. Main call to action Secondary action",
            "title": "coffee",
            "url": "/coffee/coffee.html"
        },
        {
            "tags": "",
            "text": "Harry Potter Tiere aus Holz Verschiedenes",
            "title": "WOOD",
            "url": "/wood/index.html"
        },
        {
            "tags": "",
            "text": "Tiere aus Holz Mein erstes Tier wurde eine Eule und heißt Hedwig. Dann kam der Fisch und die Katze. Main call to action Secondary action 3:10 Englisches Video 4:02 Englisches Video 7:10",
            "title": "Tiere aus Holz",
            "url": "/wood/animals.html"
        },
        {
            "tags": "",
            "text": "Gegenstände aus den Harry Potter Filmen Main call to action Secondary action Englisches Video 3:08 3:10 Englisches Video 3:09",
            "title": "Harry Potter",
            "url": "/wood/harrypotter.html"
        },
        {
            "tags": "",
            "text": "Main call to action Secondary action In diesem Video zeige ich euch, wie ich einen Ring aus Holz gemacht habe. Ein selbst gemachter Ring ist übrigens auch ein sehr tolles Muttertagsgeschenk. Englisches Video 3:07 Im diesem Video zeige ich euch, wie ich eine Tulpe aus Holz gemacht habe. Dies habe ich dann meiner Oma zu Ostern geschenkt. Englisches Video 4:15 In diesem Video zeige ich euch, wie ich einen Schneidezahn aus Holz gemacht habe. Englisches Video 5:00",
            "title": "Verschiedenes",
            "url": "/wood/things.html"
        },
        {
            "tags": "",
            "text": "Advanced features Blog demo Manual demo",
            "title": "More",
            "url": "/more/index.html"
        }
    ]
}